package db;

public class AllComm {
    public static final String allComm = """
            /start - начало работы
            /help - показать все доступные команды
            /addStudent <Фамилия> <Имя> <Ставка> - добавить нового ученика
            /students - показать всех учеников
            /delStudent <id> - удалить ученика по айди (его смотреть в /students)
            /addLesson <id ученика> <дата> <время> [длительность (минуты)] - добавить новый урок, id ученика смотреть в /students
            /replan <id урока> <дата> <время> [длительность (минуты)] - поменять дату и(или) время урока
            /regular <id ученика> <номер дня недели> <время> [длительность (минуты)] - добавить повторяющийся урок
            /lessons - все уроки
            /today - занятия на сегодня
            /week - занятия на неделе
            /plan <id урока> - пометить урок запланированным (id смотреть в /lessons)
            /done <id урока> - пометить урок выполненным (id смотреть в /lessons)
            /cancel <id урока> - пометить урок отменённым (id смотреть в /lessons)
            /lesson <id урока> - посмотреть детали урока (id смотреть в /lessons)
            /earned - сколько заработано за текущий месяц
            /earned <месяц.год> - сколько заработано за конкретный месяц
            """;
}
